org/emacs-on-windows.org
#+HUGO_BASE_DIR: ../
#+TITLE: Emacs on Windows
#+DATE: <2021-06-07 Mon 23:05>
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_TAGS: emacs
#+HUGO_CATEGORIES: Emacs
#+HUGO_DRAFT: false
* Installation
List the Emacs installation on Windows platform.
** Native Emacs
** VirtualBox with Emacs
-> [[file:emacs-on-arch-linux.org][Emacs on Arch Linux]]
** Dockerized Emacs
** Cygwin/MinGW with Emacs
** [[file:unix-utilities-on-windows.org][Chololatey]] Software
#+BEGIN_SRC sh
  choco install emacs
#+END_SRC
* [[file:unix-utilities-on-windows.org][Unix Utilities]]
* Formatter
Right now, I'm using Steve Purcell's [[https://github.com/purcell/emacs-reformatter][reformatter]] with [[https://prettier.io][Prettier]].
** Some Options
- https://github.com/purcell/emacs-reformatter
- https://github.com/lassik/emacs-format-all-the-code
- Based on Prettier
  - https://github.com/prettier/prettier-emacs
  - https://github.com/jscheid/prettier.el
  - https://github.com/raxod502/apheleia
** Install Prettier
1. Follow [[./windows-portable-nodejs.org][this guide]] to install portable Node.js
2. Globally install Prettier using =npm install -g prettier=
** Read More
- https://emacs-china.org/t/reformatter/8239
- https://erick.navarro.io/blog/creating-an-emacs-formatter-the-easy-way/
- https://levelup.gitconnected.com/how-to-format-all-files-in-a-directory-with-prettier-5f0ff5f4ffb2
* [[file:encryption.org][Encryption]]
* Shell/Term
* Debug
If you do =M-x toggle-debug-on-error=, you should get a backtrace that might show
where the error is occurring.
* Read more
- https://www.gnu.org/software/emacs/manual/html_mono/efaq-w32.html#Other-useful-ports
- https://www.emacswiki.org/emacs/EmacsMsWindowsIntegration
- http://ergoemacs.org/emacs/emacs_env_var_paths.html
- https://emacs.stackexchange.com/questions/27326/gui-emacs-sets-the-exec-path-only-from-windows-environment-variable-but-not-from
* Reference
